In [16]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
outside = ["G1", "G1", "G1", "G2","G2","G2"]
inside =[1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [3]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [4]:
inside

[1, 2, 3, 1, 2, 3]

In [5]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [17]:
df = pd.DataFrame(randn(6,2), hier_index,["A","B"])

In [18]:
df

             A         B
G1 1  2.706850  0.628133
   2  0.907969  0.503826
   3  0.651118 -0.319318
G2 1 -0.848077  0.605965
   2 -2.018168  0.740122
   3  0.528813 -0.589001

In [22]:
df.loc["G1"]

          A         B
1  2.706850  0.628133
2  0.907969  0.503826
3  0.651118 -0.319318

In [25]:
df.index.names = ["group", "index"]

In [26]:
df

                    A         B
group index
G1    1      2.706850  0.628133
      2      0.907969  0.503826
      3      0.651118 -0.319318
G2    1     -0.848077  0.605965
      2     -2.018168  0.740122
      3      0.528813 -0.589001

In [38]:
df.loc["G2"].loc[2]["B"]

0.7401220570561068

In [39]:
df.xs("G1")

              A         B
index
1      2.706850  0.628133
2      0.907969  0.503826
3      0.651118 -0.319318

In [42]:
df

                    A         B
group index
G1    1      2.706850  0.628133
      2      0.907969  0.503826
      3      0.651118 -0.319318
G2    1     -0.848077  0.605965
      2     -2.018168  0.740122
      3      0.528813 -0.589001

In [45]:
# missing data

In [46]:
d = {"A":[1,2,np.nan], "B":[5,np.nan,np.nan], "C":[1,2,3]}

In [47]:
df1 = pd.DataFrame(d)

In [48]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [51]:
df1.dropna()

     A    B  C
0  1.0  5.0  1

In [54]:
df1.fillna(value = "Fill value")

            A           B  C
0         1.0         5.0  1
1         2.0  Fill value  2
2  Fill value  Fill value  3

In [59]:
df1["A"]

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [61]:
# python group by

In [67]:
d1 = {"Company":["GOOG", "GOOG", "MSFT", "TCS", "TCS"],
     "Person":["Sam", "Anurag","Amy","Rohan","Chirag"],
     "Sales":["200","120","340","124","246"]}

In [69]:
df2 = pd.DataFrame(d1)

In [70]:
df2

  Company  Person Sales
0    GOOG     Sam   200
1    GOOG  Anurag   120
2    MSFT     Amy   340
3     TCS   Rohan   124
4     TCS  Chirag   246

In [74]:
bycomp = df2.groupby("Company")

In [75]:
bycomp

In [77]:
bycomp.sum()

              Person   Sales
Company
GOOG       SamAnurag  200120
MSFT             Amy     340
TCS      RohanChirag  124246

In [79]:
bycomp.sum().loc["TCS"]

Person    RohanChirag
Sales          124246
Name: TCS, dtype: object

In [82]:
df2.groupby("Company").max()

        Person Sales
Company
GOOG       Sam   200
MSFT       Amy   340
TCS      Rohan   246

In [84]:
df2.groupby("Company").describe().transporse()

AttributeError: 'DataFrame' object has no attribute 'transporse'